1s/ERP/extensions/liko/DataProcessors/ПриложениеКВБЗЕРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриложениеКВБЗЕРП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗакрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ТипыЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ТипыЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Кльр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/ЦеновыеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеновыеГруппы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Metal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпецКраска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентКраскоПереноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_3DТиснение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_РасчетКакОсновнойКраски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ВыгружатьКакЛак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_НаименованиеДляБирки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ТребуетсяОтвердитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_КодТабаш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_КомментарийКСоставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_УдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БазаРасчетаЦены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>БазаКоличества</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Общий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентВСмеси</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Компонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЦенаНоменклатуры</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ВидыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидПечати</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОбщийДляВидаПечати</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеИспользуетсяПлощадки</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ВидыРЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидРЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УпаковкиЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ПриложениеКВБЗЕРП/Ext/ObjectModule.bsl
Перем Единицы, МаксимальныйДиаметр;

Функция ПечатьПриложениеВБЗ() Экспорт
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПечатнаяФормаВнутреннийБланкЗаказа";
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб=Истина;
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда 
		Макет = ПолучитьМакет("Макет1");
	Иначе
		Макет = ПолучитьМакет("Макет");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Номенклатура) КАК КоличествоНаименований,
	|	СУММА(ЗаказКлиентаТовары.ДопЭтикетокВРолике) КАК ДопЭтикетокВРолике,
	|	СУММА(ЗаказКлиентаТовары.КоличествоЭтикетокВРолике) КАК КоличествоЭтикетокВРолике
	|ПОМЕСТИТЬ ВТКоличествоНаименований
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТЦифра
	|ИЗ
	|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.indigo)
	|	И ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Печать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.НомерБезПрефикса КАК НомерЗаказа,
	|	ЗаказКлиента.Версия КАК Версия,
	|	ЗаказКлиента.ТипЗаказа КАК ТипЗаказа,
	|	ЗаказКлиента.ВидЗаказа КАК ВидЗаказа,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Менеджер КАК Менеджер,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиента.Площадка КАК Площадка,
	|	ЗаказКлиента.ПовторЗаказа.НомерБезПрефикса КАК НомерПовторЗаказа,
	|	ЗаказКлиента.НомерЗаказаЭтикеток КАК НомерЗаказаЭтикеток,
	|	ЗаказКлиента.НомерЗаказаКонтрэтикеток КАК НомерЗаказаКонтрэтикеток,
	|	ЗаказКлиента.НомерЗаказаКольереток КАК НомерЗаказаКольереток,
	|	ЗаказКлиента.Тираж * 1000 КАК ТиражШт,
	|	ЗаказКлиента.МетражКВМ КАК МетражКВМ,
	|	ЗаказКлиента.МетражПМ КАК МетражПМ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.ЦеновыеГруппы
	|			ТОГДА ЗаказКлиента.ОсновнойМатериал.Код
	|		ИНАЧЕ ЗаказКлиента.ОсновнойМатериал.ЦеноваяГруппа.Код
	|	КОНЕЦ КАК ЦГКод,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ОсновнойМатериал ССЫЛКА Справочник.ЦеновыеГруппы
	|			ТОГДА ЗаказКлиента.ОсновнойМатериал.Наименование
	|		ИНАЧЕ ЗаказКлиента.ОсновнойМатериал.НаименованиеПолное
	|	КОНЕЦ КАК Материал,
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ВТКоличествоНаименований.КоличествоНаименований КАК КоличествоНаименований,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.БезЛака = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК БезЛака,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.БезЛака = ИСТИНА
	|			ТОГДА ""Без лака""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НадписьБезЛака,
	|	ЗаказКлиента.Ручьи КАК Ручьи,
	|	ЗаказКлиента.Z КАК Z,
	|	ЗаказКлиента.ШагПечати КАК ШагПечати,
	|	ЗаказКлиента.ДлинаЭтикетки КАК Длина,
	|	ЗаказКлиента.ШиринаЭтикетки КАК Ширина,
	|	ЗаказКлиента.ЭтикетокНаЛисте КАК ЭтикетокНаЛисте,
	|	ЗаказКлиента.Нарезка.Размер / 1000 КАК ШиринаРулона,
	|	ЗаказКлиента.Дизайнер КАК Дизайнер,
	|	ЗаказКлиента.ПоперечнаяРезкаТУ КАК ПоперечнаяРезкаТУ,
	|	ЗаказКлиента.КоличествоЭтикетокВСтопеТУ КАК КоличествоЭтикетокВСтопеТУ,
	|	ЗаказКлиента.ШиринаРукаваТУ КАК ШиринаРукаваТУ,
	|	ЗаказКлиента.ВертикальнаяПерфорацияТУ КАК ВертикальнаяПерфорацияТУ,
	|	ЗаказКлиента.ПоперечнаяПерфорацияТУ КАК ПоперечнаяПерфорацияТУ,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.ЦветаСтрокой КАК ЦветаСтрокой,
	|	ЗаказКлиента.СтоимостьОснастки КАК СтоимостьОснастки,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЗаказКлиента.ВидУпаковки КАК ВидУпаковки,
	|	ЗаказКлиента.КомментарийТехнолога КАК КомментарийТехнолога,
	|	ЗаказКлиента.ШтампВырубной КАК ШтампВырубной,
	|	ЗаказКлиента.ШтампВырубной.Артикул КАК ШтампВырубнойАртикул,
	|	ЗаказКлиента.Регион КАК Регион,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ПроверкаШК = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПроверкаШК,
	|	ВТКоличествоНаименований.ДопЭтикетокВРолике КАК ДопЭтикетокВРолике,
	|	ВТКоличествоНаименований.КоличествоЭтикетокВРолике КАК КоличествоЭтикетокВРолике,
	|	ЗаказКлиента.ХолостойХод КАК ХолостойХод,
	|	ВЫБОР
	|		КОГДА ВТЦифра.Заказ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеЦифры,
	|	ЗаказКлиента.КоличествоКликов КАК КоличествоКликов,
	|	ЗаказКлиента.ДлинаПечати КАК ДлинаПечати,
	|	ЗаказКлиента.ЭтикетокВПлощадиПечати КАК ЭтикетокВПлощадиПечати,
	|	ЗаказКлиента.ОбразецЦвета КАК ОбразецЦвета,
	|	ЗаказКлиента.КонтрольОТК КАК КонтрольОТК
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоНаименований КАК ВТКоличествоНаименований
	|		ПО ЗаказКлиента.Ссылка = ВТКоличествоНаименований.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦифра КАК ВТЦифра
	|		ПО ЗаказКлиента.Ссылка = ВТЦифра.Заказ
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Заказ = Выборка.Заказ;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(Выборка);
	ОбластьШапка.Параметры.НомерБланка = НомерБланка;
	ОбластьШапка.Параметры.НомерЗаказа = Выборка.НомерЗаказа+" / "+строка(Выборка.Версия);
	ОбластьШапка.Параметры.НомерПриложения = НомерПриложения;


	
	ЗапросЭт  = Новый Запрос;
	ЗапросЭт.Текст = 	
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	|	ЗаказКлиентаТовары.Номенклатура.Лико_ТипЭтикетки КАК ТипЭтикетки,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.КодЭтикеткиЗаказчика,
	|	ЗаказКлиентаТовары.Номенклатура.Лико_ТипЭтикетки,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул";
				          //	|	МАКСИМУМ(ЗаказПокупателяТовары.ОригиналМакет) КАК ОригиналМакет

	ЗапросЭт.УстановитьПараметр("Заказ", Заказ);
	
				
		
    ВыборкаНом = ЗапросЭт.Выполнить().Выбрать();

	НазваниеЭтикетки = "";
	Единицы = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	Пока выборкаНом.Следующий() Цикл
		Единицы = выборкаНом.Номенклатура.ЕдиницаИзмерения;
		ВидНом = "";
		Если выборкаНом.ТипЭтикетки = Перечисления.Лико_ТипыЭтикеток.ЭТ Тогда
			ВидНом = " (Эт)";
		ИначеЕсли выборкаНом.ТипЭтикетки = Перечисления.Лико_ТипыЭтикеток.КЭ Тогда
			ВидНом = " (КЭ)";
        ИначеЕсли выборкаНом.ТипЭтикетки = Перечисления.Лико_ТипыЭтикеток.Кльр Тогда
			ВидНом = " (Кл)";				 	
		КонецЕсли;
		Артикул =выборкаНом.Номенклатура.Артикул+" ";

		Если ЗначениеЗаполнено(ВыборкаНом.КодЭтикеткиЗаказчика) Тогда 
			НазваниеЭтикетки = НазваниеЭтикетки+ Артикул+выборкаНом.Номенклатура.Наименование+видном+" * "+выборкаНом.КодЭтикеткиЗаказчика+" * "+ВыборкаНом.Количество*1000+" * " ;
		Иначе
			НазваниеЭтикетки = НазваниеЭтикетки+Артикул+выборкаНом.Номенклатура.Наименование+видном+" * "+ВыборкаНом.Количество*1000+" * " ;
			
		КонецЕсли;
		//+?(ЗначениеЗаполнено(НазваниеЭтикетки), ", ","")
	КонецЦикла;	
	ОбластьШапка.Параметры.НазваниеЭтикетки = НазваниеЭтикетки;
	
	Количество = Выборка.ТиражШт;
	МетражПМ = Выборка.МетражПМ;
	МетражКВМ = Выборка.МетражКВМ;
		
	//Если Выборка.ХолостойХод Тогда 
	//	Если ЗначениеЗаполнено(Выборка.КоличествоЭтикетокВРолике) Тогда 
	//		КоличествоРоликов = Выборка.ТиражШт/Выборка.КоличествоЭтикетокВРолике;
	//		ДопЭтикеток = Выборка.ДопЭтикетокВРолике*КоличествоРоликов;
	//		Количество = Количество+ДопЭтикеток;
	//		МетражПМ =  Лико_Планирование.РассчитатьМетраж(количество,выборка.ЭтикетокНаЛисте, выборка.ШагПечати, выборка.Z);
	//		МетражКВМ =МетражПМ*Выборка.ШиринаРулона;
	//		//СуммаЗаказа_Расчет = Количество/1000*Цена+ Ст_Шт_Клише;				
	//	КонецЕсли;
	//КонецЕсли;	

	
	ОбластьШапка.Параметры.ТиражШт = Количество;
	ОбластьШапка.Параметры.МетражПМ =МетражПМ;
	ОбластьШапка.Параметры.МетражКвМ =МетражКВМ ;
		
		
		
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка Тогда 
		ВыборкаПеремотка = ВыборкаПеремотка();
		ВыборкаПеремотка.Следующий();
		МаксимальныйДиаметр = выборкаПеремотка.МаксимальныйДиаметр;	
		
		КоээфициентПеремотки = ПолучитьКоэффициентПеремотки();
		Если ЗначениеЗаполнено(КоээфициентПеремотки) Тогда
			ОбластьШапка.Параметры.КоэффициентПеремотки = КоээфициентПеремотки;
		КонецЕсли;
		ЗапросПараметры = Новый Запрос;
		ЗапросПараметры.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.Лико_Обозначение = """"
		|			ТОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра
		|		ИНАЧЕ Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.Лико_Обозначение
		|	КОНЕЦ КАК РабочийЦентр,
		|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку КАК МетрыНаНастройку,
		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак КАК МетрыНаБрак,
		|	Лико_ПараметрыПроизводстваЗаказа.ПроцентНаБрак * 100 КАК ПроцентНаБрак
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
		|ГДЕ
		|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
		|	И ВЫБОР
		|			КОГДА Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1
		|				ТОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр = &РабочийЦентр
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПроката";
		ЗапросПараметры.УстановитьПараметр("Заказ", Заказ);
		ЗапросПараметры.УстановитьПараметр("Рабочийцентр", Заказ.РабочийЦентр);
		сч = 1;
		ВыборкаПараметры = ЗапросПараметры.Выполнить().Выбрать();
		Пока ВыборкаПараметры.Следующий() Цикл
			ОбластьШапка.Параметры["МетрыНаНастройку"+строка(сч)]  = ВыборкаПараметры.МетрыНаНастройку;
			ОбластьШапка.Параметры["МетрыНаБрак"+строка(сч)]  = ВыборкаПараметры.МетрыНаБрак;
			ОбластьШапка.Параметры["ПроцентНаБрак"+строка(сч)]  = ВыборкаПараметры.ПроцентНаБрак;
			ОбластьШапка.Параметры["РЦ"+строка(сч)]  = ВыборкаПараметры.РабочийЦентр;
			сч = сч+1;
		КонецЦикла;
		
		
		
		ТабДокумент.Вывести(ОбластьШапка);
		
		
		ОбластьШтамп = Макет.ПолучитьОбласть("Штамп");
		ОбластьШтамп.Параметры.Заполнить(Выборка);
		
		
		ОбластьШтамп.Параметры.Заполнить(ВыборкаПеремотка);
		
		Если ЗначениеЗаполнено(ВыборкаПеремотка.Направление.ФайлКартинки) Тогда 
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				Картинка = РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаПеремотка.Направление.ФайлКартинки);
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				Картинка = Неопределено; 
			КонецПопытки;
			
			Если ЗначениеЗаполнено(Картинка) Тогда
				Если НЕ Картинка = Неопределено Тогда
					ФотоТовара = ОбластьШтамп.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
					ФотоТовара.Верх = 0;
					ФотоТовара.Лево = 0;
					ФотоТовара.РазмерКартинки = РазмерКартинки.Пропорционально;
					Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
						ФотоТовара.Картинка = Картинка;
					ИначеЕсли ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
						ФотоТовара.Картинка =Новый Картинка(Картинка);
					КонецЕсли;
					
					
					ФотоТовара.Расположить(ОбластьШтамп.Область(5, 46, 6, 50));                
				КонецЕсли;					
			КонецЕсли;	
			
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьШтамп);
		ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРаботТермоусадка");
		ОбластьВР.Параметры.ШиринаРукава = Выборка.ШиринаРукаваТУ;
		ОбластьВР.Параметры.ВертикальнаяПерфорацияТУ =  Выборка.ВертикальнаяПерфорацияТУ;
		ОбластьВР.Параметры.ПоперечнаяПерфорацияТУ =  Выборка.ПоперечнаяПерфорацияТУ;
		
		ОбластьВР.Параметры.Поперечная =  ?(ЗначениеЗаполнено(Выборка.ПоперечнаяРезкаТУ),  "","V");
		ОбластьВР.Параметры.КоличествоЭтикетокВСтопеТУ =  Выборка.КоличествоЭтикетокВСтопеТУ; 	
		
		
		ТабДокумент.Вывести(ОбластьВР);	
		
		ОбластьТУ = Макет.ПолучитьОбласть("Термоусадка");
		ОбластьТУ.Параметры.Комментарий = Заказ.Комментарий;
		ТабДокумент.Вывести(ОбластьТУ);	

	Иначе
		ТабДокумент.Вывести(ОбластьШапка);
		
		ОбластьШтамп = Макет.ПолучитьОбласть("Штамп|ЛеваяЧасть");

		ОбластьШтамп.Параметры.Заполнить(Выборка);

		
		Если Заказ.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Indigo Тогда 
			ОбластьШтамп.Параметры.ЦифроваяПечать ="Цифр. печ.";
			ДлинаПечати = Выборка.ДлинаПечати;
			Если Не ЗначениеЗаполнено(ДлинаПечати) Тогда 
				Попытка
					ДлинаЭтикеткиСПрипуском =Выборка.ШагПечати / (Выборка.ЭтикетокНаЛисте /Выборка.Ручьи);
				Исключение
						Сообщить("Ошибка расчета! Не указано количество этикеток на листе или количество ручьев.", 10);
					Возврат Неопределено;
				КонецПопытки;					
				ДлинаПечати = 0;
				КоличествоЭтикетокВРаппорте = 0;
		
				ДлинаПечати = Окр(Цел(Заказ.Рабочийцентр.Раппорт/ДлинаЭтикеткиСПрипуском)*ДлинаЭтикеткиСПрипуском,3);
				
			КонецЕсли;
			ДлинаЭтикеткиСПрипуском =Выборка.ШагПечати / (Выборка.ЭтикетокНаЛисте /Выборка.Ручьи);
			КоличествоЭтикетокВРаппорте = Цел(Заказ.Рабочийцентр.Раппорт/ДлинаЭтикеткиСПрипуском)* Выборка.Ручьи;

			ОбластьШтамп.Параметры.ДлинаПечати= ДлинаПечати; 
			ОбластьШтамп.Параметры.Площадь = ДлинаПечати*Выборка.ШиринаРулона;   
			ОбластьШтамп.Параметры.Этикеток  = КоличествоЭтикетокВРаппорте ;
			ОбластьШтамп.Параметры.КоличествоКликов =Выборка.КоличествоКликов;
			Попытка
				КоличествоЭтикеток =  МетражПМ * КоличествоЭтикетокВРаппорте /ДлинаПечати;
			Исключение
				#Если Клиент Тогда
					Предупреждение("Ошибка расчета! Не указана длина печати.", 10);
				#КонецЕсли
				Возврат Неопределено;
			КонецПопытки;
				
				//Попытка
				//	Если  Заказ.РабочийЦентр.Раппорт= 0.45 Тогда
				//		ОбластьШтамп.Параметры.ВсегоКликов = Цел(Выборка.КоличествоКликов *КоличествоЭтикеток/КоличествоЭтикетокВРаппорте);
				//	Иначе
				//	    ОбластьШтамп.Параметры.ВсегоКликов = Цел(Выборка.КоличествоКликов*2 *КоличествоЭтикеток/КоличествоЭтикетокВРаппорте);
				//	КонецЕсли;
				//Исключение
				//	#Если Клиент Тогда
				//		Предупреждение("Ошибка расчета! Не указано количество этикеток в раппорте.", 10);
				//	#КонецЕсли
				//	Возврат Неопределено;
				//КонецПопытки;

				
				
		КонецЕсли;	
	
	     
		ТабДокумент.Вывести(ОбластьШтамп);		
		ЗапросВР = Новый Запрос;
		ЗапросВР.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
		|	ЗаказКлиентаВидыРабот.Оснастка КАК Оснастка,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.Материал.Код, """") КАК МатериалКод,
		|	ЗаказКлиентаВидыРабот.Нарезка.Размер / 1000 КАК Нарезка,
		|	ЗаказКлиентаВидыРабот.Клей.Код КАК Клей,
		|	ЗаказКлиентаВидыРабот.ПроцентЗаливки КАК ПроцентЗаливки,
		|	ЗаказКлиентаВидыРабот.Дополнительно КАК Дополнительно,
		|	ЗаказКлиентаВидыРабот.Оснастка.Артикул КАК ОснасткаАртикул,
		|	ЗаказКлиентаВидыРабот.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаВидыРабот.НомерПроката КАК НомерПроката,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.РабочийЦентр.Лико_Обозначение = """"
		|			ТОГДА ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
		|		ИНАЧЕ ЗаказКлиентаВидыРабот.РабочийЦентр.Лико_Обозначение
		|	КОНЕЦ КАК ТипРЦ
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		ЗапросВР.УстановитьПараметр("Заказ", Заказ);

		ВыборкаВР = ЗапросВР.Выполнить().Выбрать();
		КоличествоВР = ВыборкаВР.количество();
		ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРабот|ЛеваяЧасть");
		сч = 0;
		Пока ВыборкаВР.Следующий() Цикл
			Если ВыборкаВР.ВидРабот = Справочники.ВидыРаботСотрудников.Термоусадка Тогда
				ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРаботТермоусадка|ЛеваяЧасть");
				ОбластьВР.Параметры.ШиринаРукава = Выборка.ШиринаРукаваТУ;
				ОбластьВР.Параметры.ВертикальнаяПерфорацияТУ =  Выборка.ВертикальнаяПерфорацияТУ;
				ОбластьВР.Параметры.ПоперечнаяПерфорацияТУ =  Выборка.ПоперечнаяПерфорацияТУ;
				ОбластьВР.Параметры.Поперечная =  ?(Выборка.ПоперечнаяРезкаТУ=Истина,"V", "");
				ОбластьВР.Параметры.КоличествоЭтикетокВСтопеТУ =  Выборка.КоличествоЭтикетокВСтопеТУ; 	
				ТабДокумент.Вывести(ОбластьВР);	
				сч=сч+1;
			ИначеЕсли ВыборкаВР.ВидРабот.Родитель = Справочники.ВидыРаботСотрудников.Нумерация Тогда
				ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРабот|ЛеваяЧасть");
				ОбластьВР.Параметры.Заполнить(ВыборкаВР);
				ОбластьВР.Параметры.ВидРабот = ВыборкаВР.ВидРабот.Наименование+" "+Строка(ВыборкаВР.Дополнительно)+" ручьев "+ВыборкаВР.ТипРЦ;
				ТабДокумент.Вывести(ОбластьВР);	
				сч=сч+1;
			ИначеЕсли ВыборкаВР.ВидРабот = Справочники.ВидыРаботСотрудников.Вырубка Тогда
				ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРабот|ЛеваяЧасть");
				ОбластьВР.Параметры.Заполнить(ВыборкаВР);
				ОбластьВР.Параметры.ВидРабот = ВыборкаВР.ВидРабот.Наименование+" "+ВыборкаВР.ТипРЦ;
				ОбластьВР.Параметры.Материал = ВыборкаВР.Оснастка;				
				ТабДокумент.Вывести(ОбластьВР);	
				сч=сч+1;
			Иначе	
				ОбластьВР = Макет.ПолучитьОбласть("СтрВидыРабот|ЛеваяЧасть");
				ОбластьВР.Параметры.Заполнить(ВыборкаВР);
				ОбластьВР.Параметры.Клей = СокрЛп(ВыборкаВР.Клей);
				ОбластьВР.Параметры.ВидРабот = ВыборкаВР.ВидРабот.Наименование+" "+ВыборкаВР.ТипРЦ;
				ОбластьВР.Параметры.Клей = СокрЛп(ВыборкаВР.Клей); 

				Если Заказ.Площадка = Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра Тогда 
				    ОбластьВР.Параметры.ВидРабот = ОбластьВР.Параметры.ВидРабот+ " "+ВыборкаВР.Оснастка.Наименование ;
				КонецЕсли;	
				ТабДокумент.Вывести(ОбластьВР);	
				сч=сч+1;
			КонецЕсли;				
		КонецЦикла;
		
		КоличествоПеремоток = ВыборкаПеремотка().Количество();	
		Если КоличествоПеремоток<=1 Тогда
			всегострок = 3;
		ИначеЕсли КоличествоПеремоток=2 Тогда
			всегострок = 4;
		ИначеЕсли КоличествоПеремоток<=4 Тогда
			всегострок = 5;
		Иначе
			всегострок = 6;
		КонецЕсли;
		ОбластьПустаяВР = Макет.ПолучитьОбласть("ПустаяСтрВидыРабот|ЛеваяЧасть");
		Пока сч< всегострок Цикл
			ТабДокумент.Вывести(ОбластьПустаяВР);	
			сч=сч+1;
		КонецЦикла;
		
		ТабДокЦвета = ПолучитьТабДокЦвета();
		ОбластьПрямоугольная = ТабДокЦвета.Область(1, 1, ТабДокЦвета.ВысотаТаблицы, ТабДокЦвета.ШиринаТаблицы);
		
		Для Счетчик = 1 По ТабДокЦвета.ШиринаТаблицы Цикл
			ТабДокумент.Область(17, 23+Счетчик-1).ШиринаКолонки = ТабДокЦвета.Область(1, Счетчик).ШиринаКолонки; // {{ DGavrilov: 11 вместо 15
		КонецЦикла;
		
		ТабДокумент.ВставитьОбласть(ОбластьПрямоугольная, ТабДокумент.Область(17, 23), ); // {{ DGavrilov: 11 вместо 15
	
		ТабДокПеремотка = ПолучитьТабДокПеремотка(Заказ);
		ОбластьПеремотка = ТабДокПеремотка.Область(1, 1, ТабДокПеремотка.ВысотаТаблицы, ТабДокПеремотка.ШиринаТаблицы);
		Для Счетчик = 1 По 28 Цикл
			ТабДокумент.Область(29, 23+Счетчик-1).ШиринаКолонки = 2;
		КонецЦикла;
			
		ТабДокумент.ВставитьОбласть(ОбластьПеремотка , ТабДокумент.Область(29, 23), );
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		//ОбластьПодвал.Параметры.пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
		//ОбластьПодвал.Параметры.ДатаПечатиБланка = ТекущаяДата();
		//ОбластьПодвал.Параметры.ОбразецЦвета = Выборка.ОбразецЦвета;
		
			
 	
		//Заполняем парметры для НФ
		ЗапросПараметры = Новый Запрос;
		ЗапросПараметры.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.Лико_Обозначение = """"
		|			ТОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра
		|		ИНАЧЕ Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.Лико_Обозначение
		|	КОНЕЦ КАК РабочийЦентр,
		|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаНастройку КАК МетрыНаНастройку,
		|	Лико_ПараметрыПроизводстваЗаказа.МетрыНаБрак КАК МетрыНаБрак,
		|	Лико_ПараметрыПроизводстваЗаказа.ПроцентНаБрак * 100 КАК ПроцентНаБрак
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
		|ГДЕ
		|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
		|	И ВЫБОР
		|			КОГДА Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1
		|				ТОГДА Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр = &РабочийЦентр
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПроката";
		ЗапросПараметры.УстановитьПараметр("Заказ", Заказ);
        ЗапросПараметры.УстановитьПараметр("РабочийЦентр", Заказ.Рабочийцентр);
		сч = 1;
		ВыборкаПараметры = ЗапросПараметры.Выполнить().Выбрать();
		Пока ВыборкаПараметры.Следующий() Цикл
			ОбластьПодвал.Параметры["МетрыНаНастройку"+строка(сч)]  = ВыборкаПараметры.МетрыНаНастройку;
			ОбластьПодвал.Параметры["МетрыНаБрак"+строка(сч)]  = ВыборкаПараметры.МетрыНаБрак;
			ОбластьПодвал.Параметры["ПроцентНаБрак"+строка(сч)]  = ВыборкаПараметры.ПроцентНаБрак;
			ОбластьПодвал.Параметры["РЦ"+строка(сч)]  = ВыборкаПараметры.РабочийЦентр;
            сч = сч+1;
		КонецЦикла;



		КоээфициентПеремотки = ПолучитьКоэффициентПеремотки();
		Если ЗначениеЗаполнено(КоээфициентПеремотки) Тогда
			ОбластьПодвал.Параметры.КоэффициентПеремотки = КоээфициентПеремотки;
		КонецЕсли;
						
	   		
//		ОбластьПодвал.Параметры.Комментарий = Выборка.Комментарий;
		ТабДокумент.Вывести(ОбластьПодвал);	
		
		
		
	КонецЕсли;
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	
	ОбластьЛист2 = Макет.ПолучитьОбласть("Лист2");
	ОбластьЛист2.Параметры.НомерЗаказа = Выборка.НомерЗаказа+" / "+строка(ВЫборка.Версия);
	ОбластьЛист2.Параметры.НомерБланка = НомерБланка;    // nadin 
	
	НомерЗаказа = Выборка.НомерЗаказа;
	ФВерсия = Формат(Выборка.Версия, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	ФНомерБланка = Формат(НомерБланка, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	ШК = Лико_Планирование.ПолучитьШтрихКодЗаказа(Заказ);		

	Рисунок = ОбластьЛист2.Рисунки.Штрихкод;
	ЗначениеШтрихкода = ШК;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ЗначениеШтрихкода));
	ПараметрыШтрихкода.Вставить("ТипКода",         4);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
	
	Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);

	ТабДокумент.Вывести(ОбластьЛист2);	
  
	
	
	
	//КонецЦикла;
	//ТабДокумент.ПолеСлева 	= 0;
	//ТабДокумент.ПолеСверху	= 0;
	//ТабДокумент.ПолеСнизу	= 0;
	//ТабДокумент.ПолеСправа	= 0;
	//ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;

	//
	//НаПринтер = ПараметрыСеанса.Лико_РабочееМесто.ПечатьСразуНаПринтер;
	//
	//ТабДокументы.Добавить(Новый Структура("ТабДок,НаПринтер", ТабДокумент, НаПринтер));
	Возврат ТабДокумент;

	
	
КонецФункции

// Экспортная процедура печати, вызываемая из основной программы
//
// Параметры:
// ВХОДЯЩИЕ:
//  МассивОбъектовНазначения - Массив - список объектов ссылочного типа для печати документа
//                 Как правило, содержит один элемент с ссылкой на вызвавший форму объект (документ, справочник)
//
// ИСХОДЯЩИЕ:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - таблица сформированных табличных документов.
//                 Как правило, содержит одну строку с именем текущей печатной формы
//  ОбъектыПечати - СписокЗначений - список объектов печати. 
//  ПараметрыВывода - Структура - Параметры сформированных табличных документов. Содержит поля:
//  						ДоступнаПечатьПоКомплектно - булево - по умолчанию Ложь
//							ПолучательЭлектронногоПисьма
//							ОтправительЭлектронногоПисьма
//
Процедура Печать(МассивОбъектовНазначения, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатнаяФормаВнутреннегоБланкЗаказа") Тогда 
	//	ТабличныеДокументы = ПечатьВнешнейПечатнойФормы(МассивОбъектовНазначения, ОбъектыПечати);
	//	Для каждого СтрокаМассива из ТабличныеДокументы Цикл
	//		ТабличныйДокумент = СтрокаМассива.ТабДок;
	//		ТекущаяСтрокаКоллекции = КоллекцияПечатныхФорм.Найти(ВРЕГ(ТабличныйДокумент.ИмяПараметровПечати), "ИмяВРЕГ");
	//		Если ТекущаяСтрокаКоллекции = Неопределено Тогда
	//			ТекущаяСтрокаКоллекции = КоллекцияПечатныхФорм.Добавить();
	//			ТекущаяСтрокаКоллекции.ИмяВРЕГ = ВРег(ТабличныйДокумент.ИмяПараметровПечати);
	//			ТекущаяСтрокаКоллекции.ИмяМакета = ТабличныйДокумент.ИмяПараметровПечати;
	//			ТекущаяСтрокаКоллекции.Экземпляров = ТабличныйДокумент.КоличествоЭкземпляров;
	//		КонецЕсли;
	//		Если КоллекцияПечатныхФорм.Колонки.Найти("НаПринтер") = Неопределено Тогда
	//			КоллекцияПечатныхФорм.Колонки.Добавить("НаПринтер");
	//		КонецЕсли;
	//		ТекущаяСтрокаКоллекции.НаПринтер = СтрокаМассива.НаПринтер;
	//		
	//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ТабличныйДокумент.ИмяПараметровПечати, ТабличныйДокумент.ИмяПараметровПечати, ТабличныйДокумент);
	//	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры


Функция ПолучитьТабДокЦвета()
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьПустая =  Макет.ПолучитьОбласть("ПраваяЧасть|ПустаяСтрЦвета");

	Запрос = новый запрос;
	Запрос.Текст=
			"ВЫБРАТЬ ПЕРВЫЕ 16
			|	ЗаказКлиентаЦвета.ВидПечати КАК ВидПечати,
			|	ЗаказКлиентаЦвета.ТипКраски.Код КАК ТипКраски,
			|	ЗаказКлиентаЦвета.Название КАК Название,
			|	ЗаказКлиентаЦвета.ПроцентЗаливки КАК ПроцентЗаливки,
			|	ЗаказКлиентаЦвета.Грамматура КАК Грамматура,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаЦвета.Цветоделение = ИСТИНА
			|				ИЛИ ЗаказКлиентаЦвета.Перегравировка = ИСТИНА
			|			ТОГДА ""V""
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК Цветоделение,
			|	ЗаказКлиентаЦвета.ЗапечатываемыйМатериал КАК ЗапечатываемыйМатериал,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоФотону)
			|			ТОГДА ""Pmc по фот""
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.PmcПоОбразцу)
			|			ТОГДА ""Pmc по обр""
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ХолодноеТиснение)
			|			ТОГДА ""Хол тисн""
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ЛакРазделительный)
			|			ТОГДА ""Лак разд""
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.ВыборочныйЛак)
			|			ТОГДА ""Выб лак""
			|		КОГДА ЗаказКлиентаЦвета.ТипЦвета = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыЦвета.РотационныйКонгрев)
			|			ТОГДА ""Рот конгр""
			|		ИНАЧЕ ЗаказКлиентаЦвета.ТипЦвета
			|	КОНЕЦ КАК ТипЦвета,
			|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката,
			|	ЗаказКлиентаЦвета.Вал.Артикул КАК Вал,
			|	ЗаказКлиентаЦвета.Форма.Код КАК Форма
			|ИЗ
			|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
			|ГДЕ
			|	ЗаказКлиентаЦвета.Ссылка = &Заказ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказКлиентаЦвета.НомерСтроки";

	Запрос.УстановитьПараметр("Заказ", Заказ);
   // ТабДокумент.Вывести(ОбластьЗаголовок);
     Выборка = Запрос.Выполнить().Выбрать();
	Сч=0;
	Пока выборка.Следующий() Цикл
		Если Заказ.Цифровой И (Выборка.ВидПечати = Перечисления.Лико_ВидыПечати.Флексо ИЛИ Выборка.ВидПечати = Перечисления.Лико_ВидыПечати.Траф) Тогда  
			ОбластьСтр = Макет.ПолучитьОбласть("ПраваяЧасть|стрЦветаФлексоНаИндиге");
		Иначе
			ОбластьСтр = Макет.ПолучитьОбласть("ПраваяЧасть|СтрЦвета");
		КонецЕсли;	

		//ОбластьСтр = Макет.ПолучитьОбласть("ПраваяЧасть|СтрЦвета");

		ОбластьСтр.Параметры.НомерСтроки = Сч+1;
		ОбластьСтр.Параметры.Заполнить(Выборка);
		Если ТипЗнч(Выборка.Название) <> Тип("ПеречислениеСсылка.Лико_ТипыЦвета") Тогда
			ОбластьСтр.Параметры.Название = Строка(Выборка.ТипЦвета)+" "+Выборка.Название;	
		КонецЕсли;
		ОбластьСтр.Параметры.ТипКраски =СокрЛП(Строка(Выборка.ТипКраски));	

		
		ТабДокумент.Вывести(ОбластьСтр);
		Сч=Сч+1;
	КонецЦикла;
	Пока сч<12 Цикл
		ТабДокумент.Вывести(ОбластьПустая);
		Сч=Сч+1;
	КонецЦикла;
	
	//ТабДокумент.Показать();
    Возврат ТабДокумент;

КонецФункции

Функция ПолучитьКодПостПечатныхработ(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПечатьСклеящегоСлоя)
	|				ТОГДА 10
	|			КОГДА ЗаказКлиентаВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Книжка)
	|				ТОГДА 14
	|			КОГДА ЗаказКлиентаВидыРабот.ВидРабот.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.Нумерация)
	|				ТОГДА 80
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КодПостпечатныхРабот
	|ИЗ
	|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	возврат Результат.Кодпостпечатныхработ;
КонецФункции

Функция ПолучитьТабДокПеремотка(Заказ)
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовокПеремотка = Макет.ПолучитьОбласть("Заголовок_Перемотка|ПраваяЧасть");
	ОбластьЗаголовокПеремотка.Параметры.ТипВыладки = Заказ.СпособНаклейки;
	ТабДокумент.Вывести(ОбластьЗаголовокПеремотка);
	
	Выборка = ВыборкаПеремотка();	
	сч = 0;
	МаксимальныйДиаметр = 1000000000;
	Пока Выборка.Следующий() Цикл
		ОбластьСтрПеремотка = Макет.ПолучитьОбласть("СтрПеремотка|ПраваяЧасть");
		ОбластьСтрПеремотка.Параметры.Заполнить(Выборка);
		Если МаксимальныйДиаметр>Выборка.МаксимальныйДиаметр Тогда
			МаксимальныйДиаметр = выборка.МаксимальныйДиаметр;			
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Направление) Тогда
			Если ЗначениеЗаполнено(Выборка.Направление.ФайлКартинки) Тогда 
				// Вывод картинки
				//	ОбластьОписаниеКартинка = Макет.ПолучитьОбласть("ОписаниеНамотка");
				Попытка
					УстановитьПривилегированныйРежим(Истина);
					Картинка = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Направление.ФайлКартинки);
					УстановитьПривилегированныйРежим(Ложь);
				Исключение
					Картинка = Неопределено; 
				КонецПопытки;
				
				Если ЗначениеЗаполнено(Картинка) Тогда
					Если НЕ Картинка = Неопределено Тогда
						ФотоТовара = ОбластьСтрПеремотка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
						ФотоТовара.Верх = 0;
						ФотоТовара.Лево = 0;
						ФотоТовара.РазмерКартинки = РазмерКартинки.Пропорционально;
						Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
							ФотоТовара.Картинка = Картинка;
						ИначеЕсли ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
							ФотоТовара.Картинка =Новый Картинка(Картинка);
						КонецЕсли;
						
						
						ФотоТовара.Расположить(ОбластьСтрПеремотка.Область(1, 24, 2, 28));               
					КонецЕсли;					
				КонецЕсли;	
				
			КонецЕсли;	
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьСтрПеремотка);	
		сч = сч+1;
	КонецЦикла;
	ОбластьПустаяСтрПеремотка = Макет.ПолучитьОбласть("ПустаяСтрПеремотка|ПраваяЧасть");
	
	Возврат ТабДокумент;
	
КонецФункции	

Функция ОпределитьКоличествоКлея(Клей)
	
	Если Клей = "453      " ИЛИ Клей = "454      " Или  Клей = "458      "   ИЛИ Клей = "455      "   ИЛИ  Клей = "457      " ИЛИ Клей = "491      "  Тогда 
		Возврат 18;
	ИначеЕсли Клей = "401      " Тогда 
		Возврат  4;
	ИначеЕсли Клей = "432      "  Тогда
		Возврат  4.5;
	Иначе
		Возврат неопределено;
	КонецЕсли;
		
КонецФункции

Функция ВыборкаПеремотка()	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	|	ЗаказПокупателяТовары.МаксимальныйДиаметрРулона КАК МаксимальныйДиаметр,
	|	ЗаказПокупателяТовары.ВнутреннийДиаметр КАК ВнутреннийДиаметр,
	|	ЗаказПокупателяТовары.КоличествоЭтикетокВРолике + ЗаказПокупателяТовары.ДопЭтикетокВРолике КАК КоличествоЭтикетокВРолике,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПродольнаяРезка = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПродольнаяРезка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПоперечнаяРезка = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоперечнаяРезка,
	|	ЗаказПокупателяТовары.Кромка КАК Кромка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПодрезкаКромки = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодрезкаКромки,
	|	ЗаказПокупателяТовары.Направление КАК Направление,
	|	ЗаказПокупателяТовары.Город КАК Город,
	|	ЗаказПокупателяТовары.Номенклатура.Лико_ТипЭтикетки КАК ТипЭтикетки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.МаксимальныйДиаметрРулона,
	|	ЗаказПокупателяТовары.ВнутреннийДиаметр,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПродольнаяРезка = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПоперечнаяРезка = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЗаказПокупателяТовары.Кромка,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ПодрезкаКромки = ИСТИНА
	|			ТОГДА ""V""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЗаказПокупателяТовары.Направление,
	|	ЗаказПокупателяТовары.Город,
	|	ЗаказПокупателяТовары.КоличествоЭтикетокВРолике + ЗаказПокупателяТовары.ДопЭтикетокВРолике,
	|	ЗаказПокупателяТовары.Номенклатура.Лико_ТипЭтикетки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ,
	|	ТипЭтикетки";	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
    Возврат Выборка;
КонецФункции

//Получить Коэффициент перемотки
Функция ПолучитьКоэффициентПеремотки()
	
	Коэффициент = 1;
	Если Заказ.ручьи >2 И Заказ.ручьи<6 Тогда 
		Коэффициент = Коэффициент+0.2;
	ИначеЕсли Заказ.ручьи >5 Тогда 
		Коэффициент = Коэффициент+0.5;
	КонецЕсли;
	
	Если МаксимальныйДиаметр<100 Тогда 
		Коэффициент = Коэффициент+0.5;
    КонецЕсли;
	Если Заказ.СпособНаклейки = Перечисления.Лико_СпособыНаклейки.Этикеровщик Тогда 
		Коэффициент = Коэффициент+0.5;
	КонецЕсли;
	
	Если ТипЗнч(Заказ.ОсновнойМатериал) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЦГ =  Заказ.ОсновнойМатериал.ЦеноваяГруппа;
	Иначе
		ЦГ =Заказ.ОсновнойМатериал;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЦГ) Тогда
		Если Прав(ЦГ.Код,2)="30" ИЛИ Прав(ЦГ.Код,2)="70" ИЛИ Прав(ЦГ.Код,2)="71" Тогда
			Коэффициент = 3;
        КонецЕсли;
	КонецЕсли;
	
	Возврат коэффициент;
КонецФункции


#Область СведенияОВнешнейОбработке
// Сервисная экспортная функция. Вызывается в основной программе при регистрации обработки в информационной базе
// Возвращает структуру с параметрами регистрации
//
// Возвращаемое значение:
//		Структура с полями:
//			Вид - строка, вид обработки, один из возможных: "ДополнительнаяОбработка", "ДополнительныйОтчет", 
//					"ЗаполнениеОбъекта", "Отчет", "ПечатнаяФорма", "СозданиеСвязанныхОбъектов"
//			Назначение - Массив строк имен объектов метаданных в формате: 
//					<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]. 
//					Например, "Документ.СчетЗаказ" или "Справочник.*". Параметр имеет смысл только для назначаемых обработок, для глобальных может не задаваться.
//			Наименование - строка - Наименование обработки, которым будет заполнено наименование элемента справочника по умолчанию.
//			Информация  - строка - Краткая информация или описание по обработке.
//			Версия - строка - Версия обработки в формате “<старший номер>.<младший номер>” используется при загрузке обработок в информационную базу.
//			БезопасныйРежим - булево - Принимает значение Истина или Ложь, в зависимости от того, требуется ли устанавливать или отключать безопасный режим 
//							исполнения обработок. Если истина, обработка будет запущена в безопасном режиме. 
//
Функция СведенияОВнешнейОбработке() Экспорт
	//Инициализируем структуру с параметрами регистрации    	
	ПараметрыРегистрации = Новый Структура;
	// Первый параметр, который мы должны указать - это какой вид обработки системе должна зарегистрировать.
	// Допустимые типы: ДополнительнаяОбработка, ДополнительныйОтчет, ЗаполнениеОбъекта, Отчет, ПечатнаяФорма, СозданиеСвязанныхОбъектов
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов...
	
	МассивНазначений = Новый Массив;
	// Теперь нам необходимо передать в виде массива имен, к чему будет подключена наша ВПФ
	// Имейте ввиду, что можно задать имя в таком виде: Документ.* - в этом случае обработка будет подключена ко всем документам в системе,
	// которые поддерживают механизм ВПФ
	МассивНазначений.Добавить("Документ.ЗаказКлиента"); //Указываем объект к которому делаем внешнюю печ. форму   		
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	
	ПараметрыРегистрации.Вставить("Наименование", "Печатная форма ""Приложение к внутреннему бланку заказа"""); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);  // Зададим право обработке на использование безопасного режима. Более подробно можно узнать в справке к платформе (метод УстановитьБезопасныйРежим)
	ПараметрыРегистрации.Вставить("Версия", "1.0");   // эти два параметра играют больше информационную роль,
	ПараметрыРегистрации.Вставить("Информация", "Дополнительная печатная форма ""Приложение к внутреннему бланку заказа"" для документа ""Заказ клиента"""); // т.е. это то, что будет видеть пользователь в информации к обработке
	
	// Создадим таблицу команд (подробнее смотрим ниже)
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "ПриложениеВБЗ", "ПечатнаяФормаВнутреннегоБланкЗаказа", "ОткрытиеФормы", Ложь, "ПечатьMXL");

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации; 	
КонецФункции
#КонецОбласти

#Область Вспомогательное
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ОБРАБОТКИ

// Формирует структуру с параметрами регистрации регистрации обработки в информационной базе
//
// Параметры:
//	ОбъектыНазначенияФормы - Массив - Массив строк имен объектов метаданных в формате: 
//					<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]. 
//					или строка с именем объекта метаданных 
//	НаименованиеОбработки - строка - Наименование обработки, которым будет заполнено наименование элемента справочника по умолчанию.
//							Необязательно, по умолчанию синоним или представление объекта
//	Информация  - строка - Краткая информация или описание обработки.
//							Необязательно, по умолчанию комментарий объекта
//	Версия - строка - Версия обработки в формате “<старший номер>.<младший номер>” используется при загрузке обработок в информационную базу.
//
//
// Возвращаемое значение:
//		Структура
//
Функция ПолучитьПараметрыРегистрации(ОбъектыНазначенияФормы = Неопределено, НаименованиеОбработки = "", Информация = "", Версия = "1.0")

	Если ТипЗнч(ОбъектыНазначенияФормы) = Тип("Строка") Тогда
		ОбъектНазначенияФормы = ОбъектыНазначенияФормы;
		ОбъектыНазначенияФормы = Новый Массив;
		ОбъектыНазначенияФормы.Добавить(ОбъектНазначенияФормы);
	КонецЕсли; 
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Назначение", ОбъектыНазначенияФормы);
	
	Если Не ЗначениеЗаполнено(НаименованиеОбработки) Тогда
		НаименованиеОбработки = ЭтотОбъект.Метаданные().Представление();
	КонецЕсли; 
	ПараметрыРегистрации.Вставить("Наименование", НаименованиеОбработки);
	
	Если Не ЗначениеЗаполнено(Информация) Тогда
		Информация = ЭтотОбъект.Метаданные().Комментарий;
	КонецЕсли; 
	ПараметрыРегистрации.Вставить("Информация", Информация);
	
	ПараметрыРегистрации.Вставить("Версия", Версия);

	Возврат ПараметрыРегистрации;

КонецФункции

// Формирует таблицу значений с командами печати
//	
// Возвращаемое значение:
//		ТаблицаЗначений
//
Функция ПолучитьТаблицуКоманд()

	Команды = Новый ТаблицаЗначений;
	
	//Представление команды в пользовательском интерфейсе
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	//Уникальный идентификатор команды или имя макета печати
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	
	//Способ вызова команды: "ОткрытиеФормы", "ВызовКлиентскогоМетода", "ВызовСерверногоМетода"
	// "ОткрытиеФормы" - применяется только для отчетов и дополнительных отчетов
	// "ВызовКлиентскогоМетода" - вызов процедуры Печать(), определённой в модуле формы обработки
	// "ВызовСерверногоМетода" - вызов процедуры Печать(), определённой в модуле объекта обработки
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	//Показывать оповещение.
	//Если Истина, требуется показать оповещение при начале и при завершении работы обработки. 
	//Имеет смысл только при запуске обработки без открытия формы
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	
	//Дополнительный модификатор команды. 
	//Используется для дополнительных обработок печатных форм на основе табличных макетов.
	//Для таких команд должен содержать строку ПечатьMXL
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

	Возврат Команды; 
КонецФункции

// Вспомогательная процедура.
//
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ВызовСерверногоМетода", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;      
КонецПроцедуры

#КонецОбласти
